## Plan Result (1151: dev_database - TerraformPlanApply)




<pre><code>Plan: 12 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.postgresql_admin_password
  * azurerm_key_vault_secret.postgresql_admin_username
  * azurerm_key_vault_secret.postgresql_host
  * azurerm_postgresql_flexible_server_active_directory_administrator.db_admin
  * azurerm_private_dns_zone_virtual_network_link.postgresql
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;semarchy&#34;]
  * module.postgresql.random_password.password
  * module.postgresql.terraform_data.trigger_password_reset




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.postgresql_admin_password will be created
  + resource "azurerm_key_vault_secret" "postgresql_admin_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/csds-semarchy-xdm-dev-rg/providers/Microsoft.KeyVault/vaults/csds-keyvault-dev"
      + name                    = "postgresql-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.postgresql_admin_username will be created
  + resource "azurerm_key_vault_secret" "postgresql_admin_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/csds-semarchy-xdm-dev-rg/providers/Microsoft.KeyVault/vaults/csds-keyvault-dev"
      + name                    = "postgresql-admin-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.postgresql_host will be created
  + resource "azurerm_key_vault_secret" "postgresql_host" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/csds-semarchy-xdm-dev-rg/providers/Microsoft.KeyVault/vaults/csds-keyvault-dev"
      + name                    = "postgresql-host"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_flexible_server_active_directory_administrator.db_admin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "db_admin" {
      + id                  = (known after apply)
      + object_id           = "05d69964-2526-4e48-a1dc-2cd14826554c"
      + principal_name      = "DTS Crime Standing Data Service Admin (env:dev)"
      + principal_type      = "Group"
      + resource_group_name = "csds-semarchy-xdm-dev-rg"
      + server_name         = "csds-postgresql-dev"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_private_dns_zone_virtual_network_link.postgresql will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "postgresql" {
      + id                    = (known after apply)
      + name                  = "postgresql-vnet-link-dev"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "csds"
          + "builtFrom"    = "hmcts/semarchy-xdm"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/csds-semarchy-xdm-dev-rg/providers/Microsoft.Network/virtualNetworks/csds-network-csds-dev"
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "csdsadmin"
      + administrator_password        = (sensitive value)
      + administrator_password_wo     = (write-only attribute)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/csds-semarchy-xdm-dev-rg/providers/Microsoft.Network/virtualNetworks/csds-network-csds-dev/subnets/csds-network-postgres-dev"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "csds-postgresql-dev"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "csds-semarchy-xdm-dev-rg"
      + sku_name                      = "GP_Standard_D8ds_v5"
      + storage_mb                    = 65536
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application"  = "csds"
          + "builtFrom"    = "hmcts/semarchy-xdm"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + version                       = "17"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "3c52c98b-07a3-4a97-92b9-298e86bb1ca9"
      + principal_name      = "DTS Platform Operations PostgreSQL Admin Access"
      + principal_type      = "Group"
      + resource_group_name = "csds-semarchy-xdm-dev-rg"
      + server_name         = "csds-postgresql-dev"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "uuid-ossp,fuzzystrmatch"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["semarchy"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "semarchy"
      + server_id = (known after apply)
    }

  # module.postgresql.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.postgresql.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 1151: dev_database - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":15,"Program":"tfcmt","SHA1":"","Target":"1151: dev_database - TerraformPlanApply","Vars":{}} -->